export const WEEK_DAYS = ['월', '화', '수', '목', '금', '토', '일'];

export const MONTHLY_EMOJI_SET = [
    '⛄',
    '❄️',
    '🌱',
    '🌱',
    '🌿',
    '🌿',
    '🌳',
    '☀️',
    '🍁',
    '🍁',
    '🍂',
    '❄️',
];

export const EMOJI_SET = [
    '😊',
    '😄',
    '😁',
    '😆',
    '🤗',
    '🙂',
    '😍',
    '😘',
    '🤩',
    '🥳',
    '😎',
    '🙌',
    '💖',
    '🌟',
    '🌈',
    '☀️',
    '⭐️',
    '✨',
    '🌟',
];

export const THANKS_MAXIMS: { maxim: string; author: string }[] = [
    { maxim: '감사는 영혼에서 피어나는 가장 아름다운 꽃입니다.', author: '헨리 워드 비처' },
    {
        maxim: '감사는 우리의 과거를 이해하게 하고,\n오늘날의 평화를 가져오며,\n내일의 비전을 창조합니다.',
        author: '멜로디 비티',
    },
    {
        maxim: '우리를 행복하게 만드는 사람들에게 감사합시다.\n그들은 우리의 영혼을 꽃피우는 매력적인 정원사입니다.',
        author: '마르셀 프루스트',
    },
    {
        maxim: '이미 당신의 삶에 있는 좋은 것들을 인정하는 것이 모든 풍요의 기초입니다.',
        author: '에크하르트 톨레',
    },
    { maxim: '감사는 최고의 덕목일 뿐만 아니라 모든 덕목의 부모입니다.', author: '키케로' },
    { maxim: '감사는 기억의 고통을 평온한 기쁨으로 바꿉니다.', author: '디트리히 본회퍼' },
    { maxim: '고난은 감사가 시작될 때 끝납니다.', author: '닐 도날드 월시' },
    {
        maxim: '감사를 느끼고 표현하지 않는 것은 선물을 포장하고 주지 않는 것과 같습니다.',
        author: '윌리엄 아서 워드',
    },
    {
        maxim: '감사는 모든 인간 감정 중에서 가장 건강합니다.\n더 많이 감사할수록, 더 많이 감사할 수 있는 것들이 생깁니다.',
        author: '지그 지글러',
    },
    {
        maxim: '감사는 당신을 더 높은 주파수로 이동시키고,\n더 나은 것들을 끌어들입니다.',
        author: '론다 번',
    },
    {
        maxim: '때때로 우리는 비의 향기, 좋아하는 음식의 맛,\n사랑하는 사람의 목소리 같은 작은 것들에 대해 감사해야 합니다.',
        author: '조셉 B. 위어슬린',
    },
    {
        maxim: '감사는 우리가 빚을 져야 할 의무이지만,\n아무도 기대해서는 안 되는 것입니다.',
        author: '장 자크 루소',
    },
    { maxim: '당신이 감사할 때,\n두려움은 사라지고 풍요가 나타납니다.', author: '토니 로빈스' },
    {
        maxim: '감사는 경외심을 부여하며, 그것은 우리의 삶과 세상을 영원히 바꾸는 일상적인 경이를 만날 수 있게 합니다.',
        author: '존 밀턴',
    },
    { maxim: '감사는 고귀한 영혼의 표식입니다.', author: '이솝' },
    {
        maxim: '감사는 평범한 날들을 감사제로 바꾸고,\n일상적인 일을 기쁨으로,\n평범한 기회를 축복으로 변화시킬 수 있습니다.',
        author: '윌리엄 아서 워드',
    },
    {
        maxim: '감사는 당신을 기쁘고 자랑스럽게 만듭니다.\n불평은 당신을 나쁘고 불행하게 만듭니다.',
        author: '막심 라가세',
    },
    { maxim: '감사는 부유함이고, 불평은 가난입니다.', author: '도리스 데이' },
    {
        maxim: '나는 오늘 아침에 새롭고 오래된 친구들에 대한\n깊은 감사의 마음으로 깨어났습니다.',
        author: '랄프 월도 에머슨',
    },
    {
        maxim: '당신이 이미 가지고 있는 것에 대해 감사하는 법을 배우고,\n당신이 원하는 모든 것을 추구하는 동안 감사하십시오.',
        author: '짐 론',
    },
    {
        maxim: '나는 감사가 최고의 사색의 형태이고,\n감사가 경이로 인해 두 배로 행복해진다는 점을 주장할 것입니다.',
        author: '길버트 K. 체스터턴',
    },
    {
        maxim: '감사는 인간의 삶에서 가장 달콤한 것입니다.\n당신의 마음에 감사가 있다면,\n당신의 눈에는 엄청난 달콤함이 있을 것입니다.',
        author: '스리 친모이',
    },
    {
        maxim: '감사를 표현하는 말이나 행동을 미루지 않도록 자신을 훈련하십시오.',
        author: '알버트 슈바이처',
    },
    {
        maxim: '우리의 삶에 변화를 가져다 주는 사람들에게 감사할 시간을 찾아야 합니다.',
        author: '존 F. 케네디',
    },
    {
        maxim: '감사는 당신을 성장하고 확장하게 하며,\n감사는 기쁨과 웃음을 당신의 삶과 주변 사람들의 삶에 가져옵니다.',
        author: '아일린 캐디',
    },
    {
        maxim: '현명한 사람은 가지지 못한 것에 대해 슬퍼하지 않고,\n가진 것에 대해 기뻐합니다.',
        author: '에픽테토스',
    },
    { maxim: '자연의 아름다움은 감사와 감탄을 기르는 선물입니다.', author: '루이 슈바르츠버그' },
    { maxim: '감사는 영혼에 저장된 기억입니다.', author: '라이오넬 햄튼' },
    { maxim: '감사는 우리가 가진 것을 충분하고 더 많은 것으로 바꿉니다.', author: '멜로디 비티' },
    {
        maxim: '우리의 보물에 대해 마음이 의식하는 순간에만\n우리는 살아 있다고 말할 수 있습니다.',
        author: '손튼 와일더',
    },
    { maxim: '감사는 가장 섬세한 예의입니다.', author: '자크 마리탱' },
    {
        maxim: '새로운 아침의 빛, 밤의 쉼터와 쉼,\n건강과 음식, 사랑과 친구,\n그리고 모든 좋은 것에 감사합니다.',
        author: '랄프 월도 에머슨',
    },
    {
        maxim: '현재 순간과 삶의 충만함에 대한 감사는 진정한 번영입니다.',
        author: '에크하르트 톨레',
    },
    {
        maxim: '우리가 감사를 표현할 때,\n우리는 말로만 감사하는 것이 아니라,\n그에 맞게 살아야 합니다.',
        author: '존 F. 케네디',
    },
    { maxim: '감사와 태도는 도전이 아니라 선택입니다.', author: '로버트 브래드' },
    {
        maxim: '당신의 삶을 바꾸고 싶다면, 감사함을 시도하십시오.\n그것은 당신의 삶을 크게 바꿀 것입니다.',
        author: '제럴드 굿',
    },
    {
        maxim: '감사는 행복의 촉매제입니다.\n그것은 당신의 영혼에 기쁨의 불꽃을 점화하는 불꽃입니다.',
        author: '에이미 콜렛',
    },
    { maxim: '감사하는 삶에는 고요한 기쁨이 있습니다.', author: '랄프 H. 블룸' },
];
